Table of Contents
 Class ReportResponse
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
The identifier of the generated report
[DataContract]
public class ReportResponse
Inheritance
object
ReportResponse
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Port
Port of grpc server which can provide a report
[DataMember]
public int Port { get; set; }
Property Value
int
 ReportId
Unique report identifier
[DataMember]
public string ReportId { get; set; }
Property Value
string
 Edit this page